function [FP,M_data,nFr]=read_FP_motion(filename)

%---------------------------------------------------------------------------------------------------------
%(Force_fileの読み込み)

 FP_File = ['.\FP\' filename '.forces']; %Foce_dataのファイル名
 FP_data = (dlmread(FP_File,'	',5,1)); %Foce_dataの読み込み
 FPD = FP_data(:,1:14); %FP1とFP2を使用(3枚目は使用していないため省く)
 
%---------------------------------------------------------------------------------------------------------
% ダウンサンプリング (フィルターなし)
        
% [B,A] = butter(2,12/1000); %Force_dataに12Hzで4次のバターワースローパスフィルター
% f_FPD = filtfilt(B,A,FPD);   
% D_f_FPD = f_FPD(1:10:end-9,:); %フィルタリングしたフォースデータをダウンサンプリング2000Hz→200Hz

  D_FPD = FPD(1:10:end-9,:); %生データのフォースデータをダウンサンプリング2000Hz→200Hz
  D_FPD = D_FPD'; %行列を逆転 (後の計算の都合上、行列を逆転しておく)
  [~,nFr] = size(D_FPD); %フレーム数算出
    
%---------------------------------------------------------------------------------------------------------
%(フォースデータの補正)

%フォースプレートに乗っていないときのノイズを除去するのには適しているが、この試技では基本的にプレートに乗っているためノイズの除去としては適していない

% for fr = 1:nFr
%     if D_FPD(3,fr) < mass*9.81*0.03 %Fz(1)の体重の3%以下は0にする (被験者の体重は70kgの設定)
%         D_FPD(3,fr) = 0;
%     end
% end
% 
% for fr=1:nFr
%     if D_FPD(10,fr) < mass*9.81*0.03 %Fz(2)の体重の3%以下は0にする
%         D_FPD(10,fr) = 0;
%     end
% end

%---------------------------------------------------------------------------------------------------------
%(フォースデータの仕分け)

   FP(1).grf = D_FPD(1:3,:);
   FP(1).cop = D_FPD(4:6,:)/1000;%mm単位→m単位
   FP(1).FM = D_FPD(5:7,:)/1000;%mm単位→m単位
   FP(1).FM(1:2,:) = 0; 
    
   FP(2).grf = D_FPD(8:10,:);
   FP(2).cop = D_FPD(11:13,:)/1000;%mm単位→m単位
   FP(2).FM = D_FPD(12:14,:)/1000;%mm単位→m単位
   FP(2).FM(1:2,:) = 0; 
    
%---------------------------------------------------------------------------------------------------------
%(motion_fileの読み込み)

  motion_file = ['.\motion\' filename '.trc'];
  M_data = (dlmread(motion_file,'	',6,2))/1000;%mm単位→m単位
    
  if M_data(:,end) == 0
      M_data(:,end) = []; %なぜかはわからないが最後の列に0が入ることがあるため、その場合最後の列を削除
  end

end
    
